# Install essential services
brew "mongodb"
brew "node-build"
brew "nodenv"
brew "watchman"
brew "yarn", args: ["without-node"]
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Add cask to brew
tap "caskroom/cask"

# Change the app installation directory
cask_args appdir: "~/Applications"

# Install essential apps
cask "atom"
cask "discord"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"

# Add fonts to cask
tap "caskroom/fonts"

# Install essential fonts
cask "font-fira-mono"
