cask_args appdir: "~/Applications"
cask_args fontdir: "~/Library/Fonts"

tap "homebrew/bundle"

tap "caskroom/cask"
tap "caskroom/fonts"

brew "mongodb"
brew "node-build"
brew "nodenv"
brew "watchman"
brew "yarn", args: ["without-node"]

cask "adobe-creative-cloud"
cask "atom"
cask "discord"
cask "firefox"
cask "font-hack"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "unity"
